In [1]:
import pandas as pd

In [12]:
s1 = pd.Series([1,2,3,4,5])

In [13]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
type(s1)

pandas.core.series.Series

In [15]:
s1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

s1

In [16]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
s2 = pd.Series({'k1':10, 'k2':20, 'k3':"Hello Mr"})

In [19]:
s2

k1          10
k2          20
k3    Hello Mr
dtype: object

In [22]:
s3 = pd.Series({'k1':10, 'k2':20, 'k3':"Hello Mr"}, index=['k3','k2','k4','k1','k5'])

In [23]:
s3

k3    Hello Mr
k2          20
k4         NaN
k1          10
k5         NaN
dtype: object

In [24]:
s4 = pd.Series([1,2,3,4,5,6,7,8,9])
s4[2]

3

In [25]:
s5 = pd.Series([1,2,3,4,5,6,7,8,9])
s5[-3:]

6    7
7    8
8    9
dtype: int64

In [26]:
s6 = pd.Series([1,2,3,4,5,6,7,8,9])
s6[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
s6+9

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
dtype: int64

In [29]:
s7 = pd.Series([1,2,3,4,5,6,7,8,9])
s8 = pd.Series([10,20,30,40,50,60,70,80,90])
s7+s8

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [30]:
s7*6

0     6
1    12
2    18
3    24
4    30
5    36
6    42
7    48
8    54
dtype: int64

In [31]:
s7/2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
5    3.0
6    3.5
7    4.0
8    4.5
dtype: float64

In [32]:
pd.DataFrame({'Name':['Taimoor','Hassan','Ali'],'Marks':[95,98,92]})

      Name  Marks
0  Taimoor     95
1   Hassan     98
2      Ali     92

In [33]:
df = pd.read_csv("Uber Drives 2016.csv")

In [34]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [35]:
df.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [36]:
df.describe()

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [39]:
df.shape

(1156, 7)

In [38]:
df.shape

(1156, 7)

In [42]:
df.iloc[0:3,0:4]

      START_DATE*       END_DATE* CATEGORY*       START*
0  1/1/2016 21:11  1/1/2016 21:17  Business  Fort Pierce
1   1/2/2016 1:25   1/2/2016 1:37  Business  Fort Pierce
2  1/2/2016 20:25  1/2/2016 20:38  Business  Fort Pierce

In [43]:
df.iloc[5:10,2:4]

  CATEGORY*           START*
5  Business  West Palm Beach
6  Business  West Palm Beach
7  Business             Cary
8  Business             Cary
9  Business          Jamaica

In [44]:
df.loc[1:10,("START_DATE*","END_DATE*")]

        START_DATE*        END_DATE*
1     1/2/2016 1:25    1/2/2016 1:37
2    1/2/2016 20:25   1/2/2016 20:38
3    1/5/2016 17:31   1/5/2016 17:45
4    1/6/2016 14:42   1/6/2016 15:49
5    1/6/2016 17:15   1/6/2016 17:19
6    1/6/2016 17:30   1/6/2016 17:35
7    1/7/2016 13:27   1/7/2016 13:33
8    1/10/2016 8:05   1/10/2016 8:25
9   1/10/2016 12:17  1/10/2016 12:44
10  1/10/2016 15:08  1/10/2016 15:51

In [50]:
df.head(7)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,1/6/2016 17:15,1/6/2016 17:19,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain
6,1/6/2016 17:30,1/6/2016 17:35,Business,West Palm Beach,Palm Beach,7.1,Meeting

In [46]:
df.drop("START_DATE*",axis=1)

,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...
1151,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,NaN,NaN,NaN,NaN,12204.7,NaN

In [49]:
df.drop([1,2,3],axis=0)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,1/6/2016 17:15,1/6/2016 17:19,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain
6,1/6/2016 17:30,1/6/2016 17:35,Business,West Palm Beach,Palm Beach,7.1,Meeting
7,1/7/2016 13:27,1/7/2016 13:33,Business,Cary,Cary,0.8,Meeting
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [51]:
df.describe()

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [52]:
df.mean()

MILES*    21.115398
dtype: float64

In [53]:
df.count()

START_DATE*    1156
END_DATE*      1155
CATEGORY*      1155
START*         1155
STOP*          1155
MILES*         1156
PURPOSE*        653
dtype: int64

In [54]:
df.min()

START_DATE*    1/1/2016 21:11
MILES*                    0.5
dtype: object

In [55]:
df.max()

START_DATE*     Totals
MILES*         12204.7
dtype: object

In [60]:
def half(s):
    return s*0.5

df[["MILES*"]].apply(half)

       MILES*
0        2.55
1        2.50
2        2.40
3        2.35
4       31.85
...       ...
1151     1.95
1152     8.10
1153     3.20
1154    24.10
1155  6102.35

[1156 rows x 1 columns]

In [58]:
df.loc[0:,("MILES*")]

0           5.1
1           5.0
2           4.8
3           4.7
4          63.7
         ...
1151        3.9
1152       16.2
1153        6.4
1154       48.2
1155    12204.7
Name: MILES*, Length: 1156, dtype: float64

In [61]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [63]:
df["START*"].value_counts()

Cary                   201
Unknown Location       148
Morrisville             85
Whitebridge             68
Islamabad               57
                      ...
Pontchartrain Beach      1
Eastgate                 1
Wake Forest              1
Hell's Kitchen           1
Almond                   1
Name: START*, Length: 177, dtype: int64

In [64]:
df.sort_values(by="MILES*")

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
420,6/8/2016 17:16,6/8/2016 17:18,Business,Soho,Tribeca,0.5,Errand/Supplies
44,1/26/2016 17:27,1/26/2016 17:29,Business,Cary,Cary,0.5,Errand/Supplies
120,2/17/2016 16:38,2/17/2016 16:43,Business,Katunayaka,Katunayaka,0.5,Errand/Supplies
1111,12/25/2016 0:10,12/25/2016 0:14,Business,Lahore,Lahore,0.6,Errand/Supplies
1110,12/24/2016 22:04,12/24/2016 22:09,Business,Lahore,Lahore,0.6,Errand/Supplies
...,...,...,...,...,...,...,...
776,9/27/2016 21:01,9/28/2016 2:37,Business,Unknown Location,Unknown Location,195.6,NaN
881,10/30/2016 15:22,10/30/2016 18:23,Business,Asheville,Mebane,195.9,NaN
270,3/25/2016 22:54,3/26/2016 1:39,Business,Jacksonville,Kissimmee,201.0,Meeting
269,3/25/2016 16:52,3/25/2016 22:22,Business,Latta,Jacksonville,310.3,Customer Visit
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN